#### 【 Pandas 초급 시험 】

**지시사항**
- 각 문항의 지시에 따라 코드를 작성하고, 지정된 변수명에 결과를 담으세요.
- 필요한 패키지: pandas, numpy (기본 제공)

In [2]:
## 모듈 로딩 
import pandas as pd
import numpy as np

<hr> 1. DataFrame 기초 생성 및 속성 이해 <hr>

- 1-1: people_basic에서 DataFrame 그대로 `q1_1`에 저장하세요.
- 1-2: 컬럼명 리스트를 `q1_2_cols`, 인덱스 RangeIndex의 시작/끝을 튜플 `q1_2_index_info`로.
- 1-3: 행 수를 `q1_3_rows`, 열 수를 `q1_3_cols`에.
- 1-4: 나이 평균과 중앙값을 튜플 `(mean, median)`로 `q1_4_stats`에.
- 1-5: 나이가 30 이상인 행만 `q1_5_df`에.

In [3]:
# === [1] DataFrame 기초 생성 및 속성 이해 ===
# 아래 변수들에 결과를 담으세요.
q1_1 = pd.DataFrame({'name':['Kim','Lee','Park','Choi','Jung'],
                     'age':[25,32,41,19,28],
                     'city':['Seoul','Busan','Daegu','Incheon','Daejeon']})
display(q1_1)

q1_2_cols = q1_1.columns
display(q1_2_cols)

q1_2_index_info = q1_1.index
display(q1_2_index_info)

q1_3_rows, q1_3_cols = len(q1_2_cols), len(q1_2_index_info)
display(q1_3_rows, q1_3_cols)

q1_4_stats = (q1_1['age'].mean(), q1_1['age'].median())
display(q1_4_stats)

q1_5_df = q1_1[q1_1['age'] >= 30]
q1_5_df

   name  age     city
0   Kim   25    Seoul
1   Lee   32    Busan
2  Park   41    Daegu
3  Choi   19  Incheon
4  Jung   28  Daejeon

Index(['name', 'age', 'city'], dtype='object')

RangeIndex(start=0, stop=5, step=1)

3

5

(np.float64(29.0), np.float64(28.0))

   name  age   city
1   Lee   32  Busan
2  Park   41  Daegu

<hr> 2. 데이터 입출력 및 컬럼/인덱스 조작 (students 사용) <hr>

- 2-1: students를 `q2_1_df`에 (이미 로드된 것을 사용).
- 2-2: 상위 5개 행을 `q2_2_head`에.
- 2-3: 컬럼명을 ['이름','국어','영어','수학']으로 변경한 DataFrame을 `q2_3_renamed`에.
- 2-4: 인덱스를 '이름'으로 설정한 DataFrame을 `q2_4_indexed`에.
- 2-5: 다시 인덱스를 초기화한 DataFrame을 `q2_5_reset`에.

In [4]:
# === [2] 데이터 입출력 및 컬럼/인덱스 조작 ===
q2_1_df = pd.read_csv(r"C:\Users\qjadl\Desktop\KDT10\TEST\01.PANDAS_활용_테스트\EXAM_DATA\students.csv")
display(q2_1_df)

q2_2_head = q2_1_df.head()
display(q2_2_head)

q2_1_df.columns = ['이름','국어','영어','수학']
q2_3_renamed = q2_1_df
display(q2_3_renamed)

q2_4_indexed = q2_1_df.set_index('이름')
display(q2_4_indexed)

q2_5_reset = q2_1_df.reset_index()
q2_5_reset

   name  kor  eng  math
0   Kim   90   88    91
1   Lee   80   79    83
2  Park   75   82    80
3  Choi   95   90    92
4  Jung   85   84    88
5   Han   70   69    72
6  Yoon   88   85    87
7   Lim   92   91    95
8   Son   77   73    78
9    Jo   83   87    85

   name  kor  eng  math
0   Kim   90   88    91
1   Lee   80   79    83
2  Park   75   82    80
3  Choi   95   90    92
4  Jung   85   84    88

     이름  국어  영어  수학
0   Kim  90  88  91
1   Lee  80  79  83
2  Park  75  82  80
3  Choi  95  90  92
4  Jung  85  84  88
5   Han  70  69  72
6  Yoon  88  85  87
7   Lim  92  91  95
8   Son  77  73  78
9    Jo  83  87  85

      국어  영어  수학
이름
Kim   90  88  91
Lee   80  79  83
Park  75  82  80
Choi  95  90  92
Jung  85  84  88
Han   70  69  72
Yoon  88  85  87
Lim   92  91  95
Son   77  73  78
Jo    83  87  85

   index    이름  국어  영어  수학
0      0   Kim  90  88  91
1      1   Lee  80  79  83
2      2  Park  75  82  80
3      3  Choi  95  90  92
4      4  Jung  85  84  88
5      5   Han  70  69  72
6      6  Yoon  88  85  87
7      7   Lim  92  91  95
8      8   Son  77  73  78
9      9    Jo  83  87  85

<hr> 3. 조건 필터링과 정렬 (cars_mpg) <hr> 

- 3-1: mpg >= 30 인 행만 `q3_1_df`에.
- 3-2: manufacturer == 'audi' & year == 1999 인 행만 `q3_2_df`에.
- 3-3: horsepower 내림차순 정렬 결과를 `q3_3_sorted`에.
- 3-4: origin별 평균 mpg Series를 `q3_4_mean_mpg`에.
- 3-5: mpg 상위 5% 차량만 `q3_5_top5p`에.

In [5]:
# === [3] 조건 필터링과 정렬 ===
q3 = pd.read_csv(r'C:\Users\qjadl\Desktop\KDT10\TEST\01.PANDAS_활용_테스트\EXAM_DATA\cars_mpg.csv')
q3_1_df = q3[q3.mpg >= 30]
display(q3_1_df)

q3_2_df = q3[(q3.manufacturer == 'audi') & (q3.year == 1999) ]
display(q3_2_df)

q3_3_sorted = q3.sort_values('horsepower')
display(q3_3_sorted)

q3_4_mean_mpg = q3[['origin','mpg']].groupby(by=['origin'],observed=True).mean()
display(q3_4_mean_mpg)

# q3_5_top5p = [q3.duplicated('model')]     ## 중복 모델이 없으니, sort정렬해서 상위 5개 인덱싱하기
q3_5_top5p = q3.sort_values('mpg',ascending=False)
n = len(q3_5_top5p.index)   # 총 개수 구하기
back = int(n * (5/100))     # 상위 5% 계산 진행 -> 1명 추출
q3_5_top5p = q3_5_top5p.iloc[:back]
q3_5_top5p

   manufacturer    model  year  mpg  horsepower  origin
1          audi       a3  2008   35         130  europe
4        toyota    camry  2015   30         160    asia
5        toyota  corolla  2017   32         150    asia
6         honda    civic  2014   34         140    asia
7         honda   accord  2019   36         145    asia
10         audi       a4  2007   31         150  europe
13        honda      fit  2013   37         118    asia
16       toyota    prius  2020   52         121    asia
17         audi       q5  2021   30         248  europe
18        honda  insight  2012   42          98    asia

  manufacturer model  year  mpg  horsepower  origin
0         audi    a1  1999   29         120  europe

   manufacturer    model  year  mpg  horsepower  origin
18        honda  insight  2012   42          98    asia
13        honda      fit  2013   37         118    asia
0          audi       a1  1999   29         120  europe
16       toyota    prius  2020   52         121    asia
1          audi       a3  2008   35         130  europe
6         honda    civic  2014   34         140    asia
7         honda   accord  2019   36         145    asia
5        toyota  corolla  2017   32         150    asia
10         audi       a4  2007   31         150  europe
4        toyota    camry  2015   30         160    asia
12       toyota     rav4  2018   29         170    asia
8           bmw     320i  2013   27         180  europe
9           bmw       x5  2020   25         190  europe
3          ford    focus  2012   28         200     usa
14          bmw       x3  2015   26         200  europe
15         ford   escape  2011   24         210     usa
17         audi       q5  2021   30         248  europe
2          ford     f150  2005   22         250     usa
11         ford  mustang  2016   21         300     usa
19          bmw       m3  2017   23         425  europe

          mpg
origin
asia    36.50
europe  28.25
usa     23.75

   manufacturer  model  year  mpg  horsepower origin
16       toyota  prius  2020   52         121   asia

<hr> 4. 결측치 처리 (titanic_simple) <hr> 

- 4-1: 컬럼별 결측치 개수 Series를 `q4_1_na`에.
- 4-2: age 결측치를 평균으로 채운 DataFrame을 `q4_2_filled`에.
- 4-3: 결측치가 1개라도 있는 행 제거 DataFrame을 `q4_3_dropna`에.
- 4-4: 결측치 여부(True/False) DataFrame을 `q4_4_isna`에.
- 4-5: 처리 전후 age 평균을 튜플로 `q4_5_before_after`에.

In [6]:
# === [4] 결측치 처리 ===
df = pd.read_csv(r'C:\Users\qjadl\Desktop\KDT10\TEST\01.PANDAS_활용_테스트\EXAM_DATA\titanic_simple.csv')
q4_1_na = []
for c in df.columns:
    q4_1_na.append( [df[c].isna().sum()] )
display(q4_1_na)

df1 = df.copy()
q4_2_filled = df1.fillna(df1.age.mean())
display(q4_2_filled)

df2 = df.copy()
q4_3_dropna = df2.dropna()
display(q4_3_dropna)

q4_4_isna = df.isna()
display(q4_4_isna)

## 결측치 처리를 평균을 채웠을때로 기준잡음 -> q4_2_filled 사용
q4_5_before_after = (df.age.mean(), q4_2_filled.age.mean())
q4_5_before_after

[[np.int64(0)], [np.int64(2)], [np.int64(0)], [np.int64(0)]]

     name   age     sex  survived
0   Allen  22.0    male         0
1   Baker  38.0  female         1
2   Clark  26.0    male         1
3   Davis  28.0  female         1
4   Evans  35.0    male         0
5  Fisher  28.0  female         1
6   Green  28.0  female         0
7    Hill  19.0    male         0
8   Irwin  54.0    male         1
9   Jones   2.0  female         1

     name   age     sex  survived
0   Allen  22.0    male         0
1   Baker  38.0  female         1
2   Clark  26.0    male         1
4   Evans  35.0    male         0
5  Fisher  28.0  female         1
7    Hill  19.0    male         0
8   Irwin  54.0    male         1
9   Jones   2.0  female         1

    name    age    sex  survived
0  False  False  False     False
1  False  False  False     False
2  False  False  False     False
3  False   True  False     False
4  False  False  False     False
5  False  False  False     False
6  False   True  False     False
7  False  False  False     False
8  False  False  False     False
9  False  False  False     False

(np.float64(28.0), np.float64(28.0))

<hr> 5. 그룹화와 집계 (employees) <hr> 

- 5-1: city 대신 employees 사용: department별 평균 salary Series를 `q5_1_dept_mean`에.
- 5-2: gender별 최대 salary Series를 `q5_2_gender_max`에.
- 5-3: (department, rank) 기준으로 salary 평균을 DataFrame `q5_3_group_mean`에.
- 5-4: salary에 대해 평균/중앙값/표준편차를 agg로 계산한 DataFrame을 `q5_4_agg`에.
- 5-5: department별 데이터 개수를 오름차순으로 정렬한 Series를 `q5_5_counts_sorted`에.

In [7]:
# === [5] 그룹화와 집계 ===
df = pd.read_csv(r'C:\Users\qjadl\Desktop\KDT10\TEST\01.PANDAS_활용_테스트\EXAM_DATA\employees.csv')
q5_1_dept_mean = df[['department','salary']].groupby(by=['department'],observed=True).mean()
display(q5_1_dept_mean)

q5_2_gender_max =  df[['gender','salary']].groupby(by=['gender'],observed=True).max()
display(q5_2_gender_max)

q5_3_group_mean = df[['department','rank','salary']].groupby(by=['department','rank'],observed=True).mean()
display(q5_3_group_mean)

q5_4_agg = df.groupby(by=['salary'],observed=True)['salary'].agg(['mean','median','std'])
display(q5_4_agg)

q5_5_counts_sorted =df['department'].value_counts().sort_values()
q5_5_counts_sorted

                 salary
department
Finance     4950.000000
HR          5800.000000
IT          6200.000000
Sales       5933.333333

        salary
gender
F         9100
M         8700

                 salary
department rank
Finance    Jr    3900.0
           Sr    6000.0
HR         Jr    3300.0
           Mgr   8700.0
           Sr    5400.0
IT         Jr    4000.0
           Mgr   8200.0
           Sr    6300.0
Sales      Jr    3500.0
           Mgr   9100.0
           Sr    5200.0

          mean  median  std
salary
3300    3300.0  3300.0  NaN
3500    3500.0  3500.0  NaN
3900    3900.0  3900.0  NaN
4000    4000.0  4000.0  NaN
5200    5200.0  5200.0  NaN
5400    5400.0  5400.0  NaN
6000    6000.0  6000.0  NaN
6100    6100.0  6100.0  NaN
6500    6500.0  6500.0  NaN
8200    8200.0  8200.0  NaN
8700    8700.0  8700.0  NaN
9100    9100.0  9100.0  NaN

department
Finance    2
Sales      3
HR         3
IT         4
Name: count, dtype: int64

<hr> 6. 피벗과 멀티인덱스 (sales_data) <hr>

- 6-1: city=행, gender=열, 값=sales 평균 pivot_table -> `q6_1_pivot`.
- 6-2: NaN을 0으로 채우고 int로 변환 -> `q6_2_filled`.
- 6-3: pivot에 연간 총합 컬럼 total 추가 -> `q6_3_total`.
- 6-4: sales_data를 melt -> id_vars=['city','gender'], var_name='metric', value_name='value' -> `q6_4_melt`.
- 6-5: long형에서 city별, gender별 평균 value DataFrame -> `q6_5_group`.

In [8]:
# === [6] 피벗과 멀티인덱스 ===
df = pd.read_csv(r'C:\Users\qjadl\Desktop\KDT10\TEST\01.PANDAS_활용_테스트\EXAM_DATA\sales_data.csv')
q6_1_pivot = pd.pivot_table(data=df, index='city', columns='gender', values='sales', aggfunc='mean')
display(q6_1_pivot)

## NaN이 없음 -> 형변환만 진행
# display(q6_1_pivot.isna())  # Nan이 없음
# q6_2_filled.info()               # bool
q6_2_filled = q6_1_pivot.astype('int')
# q6_2_filled.info()               # int로 변환됨
display(q6_2_filled)

#########
q6_2_filled['total'] = q6_2_filled.values.sum()
q6_3_total = q6_2_filled
display(q6_3_total)

q6_4_melt = pd.melt(df, id_vars=['city','gender'], var_name='metric',value_name='value')
display(q6_4_melt)

# long형 ?
q6_5_group = ...

gender      F      M
city
Busan   170.0  160.0
Daegu   210.0  170.0
Seoul   150.0  150.0

gender    F    M
city
Busan   170  160
Daegu   210  170
Seoul   150  150

gender    F    M  total
city
Busan   170  160   1010
Daegu   210  170   1010
Seoul   150  150   1010

     city gender   metric value
0   Seoul      M  quarter    Q1
1   Seoul      F  quarter    Q1
2   Seoul      M  quarter    Q2
3   Busan      M  quarter    Q2
4   Busan      F  quarter    Q3
5   Busan      F  quarter    Q4
6   Daegu      M  quarter    Q3
7   Daegu      F  quarter    Q4
8   Seoul      M    sales   120
9   Seoul      F    sales   150
10  Seoul      M    sales   180
11  Busan      M    sales   160
12  Busan      F    sales   140
13  Busan      F    sales   200
14  Daegu      M    sales   170
15  Daegu      F    sales   210

<hr> 7. 병합과 결합 (user_info, user_score) <hr>

- 7-1: 두 DF를 id로 내부 조인 -> `q7_1_inner`.
- 7-2: 동일 컬럼명 충돌시 접미사 적용 예시: (`suffixes=('_L','_R')`)로 머지 -> `q7_2_suffix`.
- 7-3: user_score를 id 기준으로 평균 점수를 구한 DF -> `q7_3_score_mean`.
- 7-4: user_info와 7-3 결과를 left join -> `q7_4_left`.
- 7-5: user_info와 user_score를 행 방향 concat -> `q7_5_concat` (ignore_index=True).

In [9]:
# === [7] 병합과 결합 ===
df_info = pd.read_csv(r'C:\Users\qjadl\Desktop\KDT10\TEST\01.PANDAS_활용_테스트\EXAM_DATA\user_info.csv')
df_score = pd.read_csv(r'C:\Users\qjadl\Desktop\KDT10\TEST\01.PANDAS_활용_테스트\EXAM_DATA\user_score.csv')

q7_1_inner = pd.concat([df_info,df_score], join='inner',keys='id')
display(q7_1_inner)

q7_2_suffix = pd.merge(df_info, df_score,suffixes=('_L','_R'))
display(q7_2_suffix)

q7_3_score_mean = pd.merge(left=df_score, right=df_info, left_on=['id'], right_on=['id'])
q7_3_score_mean['mean score'] = q7_3_score_mean.score.mean()
display(q7_3_score_mean)

q7_4_left = pd.merge(left=df_info, right=q7_3_score_mean, left_on=['id'], right_on=['id'])
q7_4_left['mean score'] = q7_4_left.score.mean()
display(q7_4_left)


q7_5_concat = pd.concat([df_info,df_score],axis='index')
display(q7_5_concat)

     id
i 0   1
  1   2
  2   3
  3   4
  4   5
d 0   1
  1   2
  2   2
  3   3
  4   6

   id  name  age  score
0   1   Kim   25     88
1   2   Lee   32     92
2   2   Lee   32     85
3   3  Park   41     77

   id  score  name  age  mean score
0   1     88   Kim   25        85.5
1   2     92   Lee   32        85.5
2   2     85   Lee   32        85.5
3   3     77  Park   41        85.5

   id name_x  age_x  score name_y  age_y  mean score
0   1    Kim     25     88    Kim     25        85.5
1   2    Lee     32     92    Lee     32        85.5
2   2    Lee     32     85    Lee     32        85.5
3   3   Park     41     77   Park     41        85.5

   id  name   age  score
0   1   Kim  25.0    NaN
1   2   Lee  32.0    NaN
2   3  Park  41.0    NaN
3   4  Choi  19.0    NaN
4   5  Jung  28.0    NaN
0   1   NaN   NaN   88.0
1   2   NaN   NaN   92.0
2   2   NaN   NaN   85.0
3   3   NaN   NaN   77.0
4   6   NaN   NaN   90.0

<hr> 8. apply / lambda / 사용자 정의 함수 (apply_test) <hr>

- 8-1: score1의 제곱근 Series -> `q8_1_sqrt`.
- 8-2: 행 단위(axis=1)로 score1+score2 합 Series -> `q8_2_row_sum`.
- 8-3: name과 age를 결합한 full_name('Kim_25' 형식) Series -> `q8_3_fullname`.
- 8-4: age>=30 -> '성인' else '청년' Series -> `q8_4_age_group`.
- 8-5: 수치형 컬럼 평균을 반환하는 사용자 함수 `num_mean(df)` 정의하고, 결과를 `q8_5_num_mean`에.

In [10]:
# === [8] apply / lambda / 사용자 정의 함수 ===
df = pd.read_csv(r'C:\Users\qjadl\Desktop\KDT10\TEST\01.PANDAS_활용_테스트\EXAM_DATA\apply_test.csv')

q8_1_sqrt = df.score1 ** (1/2)
display(q8_1_sqrt)

q8_2_row_sum = df[['score1','score2']].sum(axis=1)
display(q8_2_row_sum)

df2 = df.copy()
df2.age = df2.age.astype('str')
df2['full_name'] = df2.name + '_' + df2.age
q8_3_fullname = df2.full_name
display(q8_3_fullname)

df3 = df.copy()
df3['성인 혹은 청년'] = df3['age'].apply(lambda x: '성인' if x >= 30 else '청년')
q8_4_age_group = df3
display(q8_4_age_group)


def num_mean(df):
    ## 수치형 컬럼을 찾기
    df = df.select_dtypes(include=['number'])
    ## 수치형 컬럼의 평균 구하기
    return df.mean()

q8_5_num_mean = num_mean(df)
display(q8_5_num_mean)

0    8.944272
1    8.660254
2    9.486833
3    9.219544
4    8.366600
5    9.380832
Name: score1, dtype: float64

0    158
1    157
2    182
3    172
4    143
5    173
dtype: int64

0     Kim_25
1     Lee_31
2    Park_29
3    Choi_34
4    Jung_22
5     Han_27
Name: full_name, dtype: object

   name  age  score1  score2 성인 혹은 청년
0   Kim   25      80      78       청년
1   Lee   31      75      82       성인
2  Park   29      90      92       청년
3  Choi   34      85      87       성인
4  Jung   22      70      73       청년
5   Han   27      88      85       청년

age       28.000000
score1    81.333333
score2    82.833333
dtype: float64

<hr> 9. 고급 응용 (analyze) <hr>

- 9-1: groupby city로 score 평균 Series -> `q9_1_city_score_mean`.
- 9-2: score 상위 10% 행만 DataFrame -> `q9_2_top10p`.
- 9-3: cut으로 age를 3구간으로 나누고 각 구간의 income 평균 Series -> `q9_3_bin_income_mean`.
- 9-4: 수치형 상관계수 DataFrame -> `q9_4_corr`.
- 9-5: 상관계수 절댓값이 가장 큰 쌍의 컬럼명 튜플 -> `q9_5_max_pair`.

In [13]:
# === [9] 고급 응용 ===
df = pd.read_csv(r'C:\Users\qjadl\Desktop\KDT10\TEST\01.PANDAS_활용_테스트\EXAM_DATA\analyze.csv')

q9_1_city_score_mean = df[['city','score']].groupby(by='city', observed=True).mean()
display(q9_1_city_score_mean)

q9_2_top10p = df.sort_values('score', ascending=False)
n = len(df.index)   # 전체 개수
back = int(n * (10/100))
# print(back)
q9_2_top10p = q9_2_top10p.iloc[:back]
display(q9_2_top10p)

df1 = df.copy()
q9_3_bin_income_mean = pd.cut(df1['age'], bins=3)
q9_3_bin_income_mean = df1.groupby(by=q9_3_bin_income_mean, observed=True)['income'].mean()
display(q9_3_bin_income_mean)

df2 = df.copy()
q9_4_corr = df2.corr(numeric_only=True)
display(q9_4_corr)

######
q9_5_max_pair = ...

           score
city
Busan  81.000000
Daegu  85.666667
Seoul  79.750000

   age  score  income   city
9   45     91    4000  Seoul

age
(19.975, 28.333]    2200.000000
(28.333, 36.667]    2933.333333
(36.667, 45.0]      3733.333333
Name: income, dtype: float64

             age     score   income
age     1.000000  0.978567  0.99600
score   0.978567  1.000000  0.95863
income  0.996000  0.958630  1.00000

<hr> 10. 인덱스와 멀티인덱스 (multi_index) <hr> 

- 10-1: class, number를 인덱스로 설정한 DataFrame -> `q10_1_setidx`.
- 10-2: subject별 mid 평균 Series -> `q10_2_subj_mid_mean`.
- 10-3: 인덱스 초기화 DataFrame -> `q10_3_reset`.
- 10-4: 인덱스 이름을 ('반','번호')로 설정한 DataFrame -> `q10_4_named`.
- 10-5: (class, subject) 기준 mid 평균을 pivot_table로 wide 구성 -> `q10_5_pivot`.

In [51]:
# === [10] 인덱스와 멀티인덱스 ===
q10_1_setidx = ...
q10_2_subj_mid_mean = ...
q10_3_reset = ...
q10_4_named = ...
q10_5_pivot = ...